---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCEntityTreeUIService
source: html/7a8a2be5-1f3b-52f7-56a3-ffe14857f68e.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCEntityTreeUIService Property

The UI service which permits registration of an external server for new UI managing IFCEntity Selection

## Syntax (C#)
```csharp
public static ExternalServiceId IFCEntityTreeUIService { get; }
```